[
    {
        "paper_title": "Latent Task Adaptation with Large-Scale Hierarchies",
        "paper_authors": "Yangqing Jia, Trevor Darrell",
        "url": "http://openaccess.thecvf.com/content_iccv_2013/html/Jia_Latent_Task_Adaptation_2013_ICCV_paper.html",
        "abstract": "Recent years have witnessed the success of large-scale image classification systems that are able to identify objects among thousands of possible labels. However, it is yet unclear how general classifiers such as ones trained on ImageNet can be optimally adapted to specific tasks, each of which only covers a semantically related subset of all the objects in the world. It is inefficient and suboptimal to retrain classifiers whenever a new task is given, and is inapplicable when tasks are not given explicitly, but implicitly specified as a set of image queries. In this paper we propose a novel probabilistic model that jointly identifies the underlying task and performs prediction with a lineartime probabilistic inference algorithm, given a set of query images from a latent task. We present efficient ways to estimate parameters for the model, and an open-source toolbox to train classifiers distributedly at a large scale. Empirical results based on the ImageNet data showed significant performance increase over several baseline algorithms.",
        "pdf_url": "http://openaccess.thecvf.com/../../content_iccv_2013/papers/Jia_Latent_Task_Adaptation_2013_ICCV_paper.pdf"
    },
    {
        "paper_title": "Image Co-segmentation via Consistent Functional Maps",
        "paper_authors": "Fan Wang, Qixing Huang, Leonidas J. Guibas",
        "url": "http://openaccess.thecvf.com/content_iccv_2013/html/Wang_Image_Co-segmentation_via_2013_ICCV_paper.html",
        "abstract": "Joint segmentation of image sets has great importance for object recognition, image classification, and image retrieval. In this paper, we aim to jointly segment a set of images starting from a small number of labeled images or none at all. To allow the images to share segmentation information with each other, we build a network that contains segmented as well as unsegmented images, and extract functional maps between connected image pairs based on image appearance features. These functional maps act as general property transporters between the images and, in particular, are used to transfer segmentations. We define and operate in a reduced functional space optimized so that the functional maps approximately satisfy cycle-consistency under composition in the network. A joint optimization framework is proposed to simultaneously generate all segmentation functions over the images so that they both align with local segmentation cues in each particular image, and agree with each other under network transportation. This formulation allows us to extract segmentations even with no training data, but can also exploit such data when available. The collective effect of the joint processing using functional maps leads to accurate information sharing among images and yields superior segmentation results, as shown on the iCoseg, MSRC, and PASCAL data sets.",
        "pdf_url": "http://openaccess.thecvf.com/../../content_iccv_2013/papers/Wang_Image_Co-segmentation_via_2013_ICCV_paper.pdf"
    },
    {
        "paper_title": "Manipulation Pattern Discovery: A Nonparametric Bayesian Approach",
        "paper_authors": "Bingbing Ni, Pierre Moulin",
        "url": "http://openaccess.thecvf.com/content_iccv_2013/html/Ni_Manipulation_Pattern_Discovery_2013_ICCV_paper.html",
        "abstract": "We aim to unsupervisedly discover human's action (motion) patterns of manipulating various objects in scenarios such as assisted living. We are motivated by two key observations. First, large variation exists in motion patterns associated with various types of objects being manipulated, thus manually defining motion primitives is infeasible. Second, some motion patterns are shared among different objects being manipulated while others are object specific. We therefore propose a nonparametric Bayesian method that adopts a hierarchical Dirichlet process prior to learn representative manipulation (motion) patterns in an unsupervised manner. Taking easy-to-obtain object detection score maps and dense motion trajectories as inputs, the proposed probabilistic model can discover motion pattern groups associated with different types of objects being manipulated with a shared manipulation pattern dictionary. The size of the learned dictionary is automatically inferred. Comprehensive experiments on two assisted living benchmarks and a cooking motion dataset demonstrate superiority of our learned manipulation pattern dictionary in representing manipulation actions for recognition.",
        "pdf_url": "http://openaccess.thecvf.com/../../content_iccv_2013/papers/Ni_Manipulation_Pattern_Discovery_2013_ICCV_paper.pdf"
    }
]